spec/fixtures/vcr_cassettes/user_upgrade_plan.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/customers
    body:
      encoding: UTF-8
      string: description=steve.aoki%40gmail.com&plan=Free+Trial
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.3.3 p222 (2016-11-21)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21 PST
        2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Mar 2017 07:56:40 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2829'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AEkCGpydWgg949
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AEkCgeWspSYNfc",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/cards"
          },
          "created": 1488786999,
          "currency": "usd",
          "default_card": null,
          "default_source": null,
          "delinquent": false,
          "description": "steve.aoki@gmail.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_AEkCI587eLJsTH",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1488786999,
                "current_period_end": 1489996599,
                "current_period_start": 1488786999,
                "customer": "cus_AEkCgeWspSYNfc",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_19uGhvBgrAjRvl1eGPJlE6kL",
                      "object": "subscription_item",
                      "created": 1488787000,
                      "plan": {
                        "id": "Free Trial",
                        "object": "plan",
                        "amount": 0,
                        "created": 1447767566,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Free Trial",
                        "statement_descriptor": null,
                        "trial_period_days": 14,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_AEkCI587eLJsTH"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "Free Trial",
                  "object": "plan",
                  "amount": 0,
                  "created": 1447767566,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Free Trial",
                  "statement_descriptor": null,
                  "trial_period_days": 14,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1488786999,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1489996599,
                "trial_start": 1488786999
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/subscriptions"
          }
        }
    http_version: 
  recorded_at: Mon, 06 Mar 2017 07:56:40 GMT
- request:
    method: get
    uri: https://api.stripe.com/v1/customers/cus_AEkCgeWspSYNfc
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.3.3 p222 (2016-11-21)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21 PST
        2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Mar 2017 07:56:48 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '2829'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AEkCbFjlEz4iEN
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AEkCgeWspSYNfc",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/cards"
          },
          "created": 1488786999,
          "currency": "usd",
          "default_card": null,
          "default_source": null,
          "delinquent": false,
          "description": "steve.aoki@gmail.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_AEkCI587eLJsTH",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1488786999,
                "current_period_end": 1489996599,
                "current_period_start": 1488786999,
                "customer": "cus_AEkCgeWspSYNfc",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_19uGhvBgrAjRvl1eGPJlE6kL",
                      "object": "subscription_item",
                      "created": 1488787000,
                      "plan": {
                        "id": "Free Trial",
                        "object": "plan",
                        "amount": 0,
                        "created": 1447767566,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Free Trial",
                        "statement_descriptor": null,
                        "trial_period_days": 14,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_AEkCI587eLJsTH"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "Free Trial",
                  "object": "plan",
                  "amount": 0,
                  "created": 1447767566,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Free Trial",
                  "statement_descriptor": null,
                  "trial_period_days": 14,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1488786999,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1489996599,
                "trial_start": 1488786999
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/subscriptions"
          }
        }
    http_version: 
  recorded_at: Mon, 06 Mar 2017 07:56:48 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_AEkCgeWspSYNfc/sources
    body:
      encoding: UTF-8
      string: source=tok_19uGi3BgrAjRvl1e9RfX5SfP
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.3.3 p222 (2016-11-21)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21 PST
        2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Mar 2017 07:56:49 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '578'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AEkCVRKmGohc5L
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_19uGi3BgrAjRvl1eXtzCtg5E",
          "object": "card",
          "address_city": null,
          "address_country": null,
          "address_line1": null,
          "address_line1_check": null,
          "address_line2": null,
          "address_state": null,
          "address_zip": null,
          "address_zip_check": null,
          "brand": "Visa",
          "country": "US",
          "customer": "cus_AEkCgeWspSYNfc",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2029,
          "fingerprint": "gfiwz91dPIZDOAds",
          "funding": "credit",
          "last4": "4242",
          "metadata": {},
          "name": null,
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Mon, 06 Mar 2017 07:56:49 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_AEkCgeWspSYNfc/sources/card_19uGi3BgrAjRvl1eXtzCtg5E
    body:
      encoding: US-ASCII
      string: ''
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.3.3 p222 (2016-11-21)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21 PST
        2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Mar 2017 07:56:50 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '578'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AEkCd2rcv0eV5C
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "card_19uGi3BgrAjRvl1eXtzCtg5E",
          "object": "card",
          "address_city": null,
          "address_country": null,
          "address_line1": null,
          "address_line1_check": null,
          "address_line2": null,
          "address_state": null,
          "address_zip": null,
          "address_zip_check": null,
          "brand": "Visa",
          "country": "US",
          "customer": "cus_AEkCgeWspSYNfc",
          "cvc_check": "pass",
          "dynamic_last4": null,
          "exp_month": 12,
          "exp_year": 2029,
          "fingerprint": "gfiwz91dPIZDOAds",
          "funding": "credit",
          "last4": "4242",
          "metadata": {},
          "name": null,
          "tokenization_method": null
        }
    http_version: 
  recorded_at: Mon, 06 Mar 2017 07:56:50 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/customers/cus_AEkCgeWspSYNfc
    body:
      encoding: UTF-8
      string: default_card=card_19uGi3BgrAjRvl1eXtzCtg5E
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.3.3 p222 (2016-11-21)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21 PST
        2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Mar 2017 07:56:51 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '4349'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AEkC7C7kZmVMNe
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "cus_AEkCgeWspSYNfc",
          "object": "customer",
          "account_balance": 0,
          "cards": {
            "object": "list",
            "data": [
              {
                "id": "card_19uGi3BgrAjRvl1eXtzCtg5E",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AEkCgeWspSYNfc",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2029,
                "fingerprint": "gfiwz91dPIZDOAds",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/cards"
          },
          "created": 1488786999,
          "currency": "usd",
          "default_card": "card_19uGi3BgrAjRvl1eXtzCtg5E",
          "default_source": "card_19uGi3BgrAjRvl1eXtzCtg5E",
          "delinquent": false,
          "description": "steve.aoki@gmail.com",
          "discount": null,
          "email": null,
          "livemode": false,
          "metadata": {},
          "shipping": null,
          "sources": {
            "object": "list",
            "data": [
              {
                "id": "card_19uGi3BgrAjRvl1eXtzCtg5E",
                "object": "card",
                "address_city": null,
                "address_country": null,
                "address_line1": null,
                "address_line1_check": null,
                "address_line2": null,
                "address_state": null,
                "address_zip": null,
                "address_zip_check": null,
                "brand": "Visa",
                "country": "US",
                "customer": "cus_AEkCgeWspSYNfc",
                "cvc_check": "pass",
                "dynamic_last4": null,
                "exp_month": 12,
                "exp_year": 2029,
                "fingerprint": "gfiwz91dPIZDOAds",
                "funding": "credit",
                "last4": "4242",
                "metadata": {},
                "name": null,
                "tokenization_method": null
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/sources"
          },
          "subscriptions": {
            "object": "list",
            "data": [
              {
                "id": "sub_AEkCI587eLJsTH",
                "object": "subscription",
                "application_fee_percent": null,
                "cancel_at_period_end": false,
                "canceled_at": null,
                "created": 1488786999,
                "current_period_end": 1489996599,
                "current_period_start": 1488786999,
                "customer": "cus_AEkCgeWspSYNfc",
                "discount": null,
                "ended_at": null,
                "items": {
                  "object": "list",
                  "data": [
                    {
                      "id": "si_19uGhvBgrAjRvl1eGPJlE6kL",
                      "object": "subscription_item",
                      "created": 1488787000,
                      "plan": {
                        "id": "Free Trial",
                        "object": "plan",
                        "amount": 0,
                        "created": 1447767566,
                        "currency": "usd",
                        "interval": "month",
                        "interval_count": 1,
                        "livemode": false,
                        "metadata": {},
                        "name": "Free Trial",
                        "statement_descriptor": null,
                        "trial_period_days": 14,
                        "statement_description": null
                      },
                      "quantity": 1
                    }
                  ],
                  "has_more": false,
                  "total_count": 1,
                  "url": "/v1/subscription_items?subscription=sub_AEkCI587eLJsTH"
                },
                "livemode": false,
                "metadata": {},
                "plan": {
                  "id": "Free Trial",
                  "object": "plan",
                  "amount": 0,
                  "created": 1447767566,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Free Trial",
                  "statement_descriptor": null,
                  "trial_period_days": 14,
                  "statement_description": null
                },
                "quantity": 1,
                "start": 1488786999,
                "status": "trialing",
                "tax_percent": null,
                "trial_end": 1489996599,
                "trial_start": 1488786999
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/customers/cus_AEkCgeWspSYNfc/subscriptions"
          }
        }
    http_version: 
  recorded_at: Mon, 06 Mar 2017 07:56:51 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/subscriptions/sub_AEkCI587eLJsTH
    body:
      encoding: UTF-8
      string: plan=Hobbyist
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/2.0.1
      Authorization:
      - Bearer <STRIPE_KEY>
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"2.0.1","lang":"ruby","lang_version":"2.3.3 p222 (2016-11-21)","platform":"x86_64-darwin16","engine":"ruby","publisher":"stripe","uname":"Darwin
        okirakugokiraku 16.4.0 Darwin Kernel Version 16.4.0: Thu Dec 22 22:53:21 PST
        2016; root:xnu-3789.41.3~3/RELEASE_X86_64 x86_64","hostname":"okirakugokiraku"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Mon, 06 Mar 2017 07:56:52 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1606'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_AEkCGZtL7QisBH
      Stripe-Version:
      - '2014-09-08'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "sub_AEkCI587eLJsTH",
          "object": "subscription",
          "application_fee_percent": null,
          "cancel_at_period_end": false,
          "canceled_at": null,
          "created": 1488786999,
          "current_period_end": 1491465412,
          "current_period_start": 1488787012,
          "customer": "cus_AEkCgeWspSYNfc",
          "discount": null,
          "ended_at": null,
          "items": {
            "object": "list",
            "data": [
              {
                "id": "si_19uGhvBgrAjRvl1eGPJlE6kL",
                "object": "subscription_item",
                "created": 1488787000,
                "plan": {
                  "id": "Hobbyist",
                  "object": "plan",
                  "amount": 2000,
                  "created": 1447767417,
                  "currency": "usd",
                  "interval": "month",
                  "interval_count": 1,
                  "livemode": false,
                  "metadata": {},
                  "name": "Hobbyist",
                  "statement_descriptor": null,
                  "trial_period_days": null,
                  "statement_description": null
                },
                "quantity": 1
              }
            ],
            "has_more": false,
            "total_count": 1,
            "url": "/v1/subscription_items?subscription=sub_AEkCI587eLJsTH"
          },
          "livemode": false,
          "metadata": {},
          "plan": {
            "id": "Hobbyist",
            "object": "plan",
            "amount": 2000,
            "created": 1447767417,
            "currency": "usd",
            "interval": "month",
            "interval_count": 1,
            "livemode": false,
            "metadata": {},
            "name": "Hobbyist",
            "statement_descriptor": null,
            "trial_period_days": null,
            "statement_description": null
          },
          "quantity": 1,
          "start": 1488787012,
          "status": "active",
          "tax_percent": null,
          "trial_end": null,
          "trial_start": null
        }
    http_version: 
  recorded_at: Mon, 06 Mar 2017 07:56:52 GMT
recorded_with: VCR 3.0.3
